БИТУправление_медицинским_центром_демо/src/InformationRegisters/УчетнаяПолитика/УчетнаяПолитика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитика</name>
  <resources>
    <name>ВестиУчетДлительностиРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьСертификаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиУчетРасходаМатериаловНаУслуги</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВремяНачалаРаботы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяОкончанияРаботы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗапретитьПроведениеПродажиНоменклатурыБезДоговора</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойПрейскурант</name>
    <type>
      <types>CatalogRef.Прейскуранты</types>
    </type>
  </resources>
  <resources>
    <name>ПрейскурантРасчетаСтоимостиМатериалов</name>
    <type>
      <types>CatalogRef.Прейскуранты</types>
    </type>
  </resources>
  <resources>
    <name>ШиринаКолонкиРаботыЖурналаЗаписи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВысотаСтрокиЖурналаЗаписи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьНесколькоСотрудниковВДокументах</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОсновноеЗначениеПереключателяНесколькихСотрудниковВЗаявке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьШтрихкодированиеКлиентов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьСтраховыеПолисы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойЦветЗаявки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнаяСтатьяДДСОказанияУслуг</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьПродажуПоНулевойСтоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СписыватьПартииВМинус</name>
    <comment>0 - проводить, не списывая в минус; 1 - проводить в минус;  2 - отказ проведения; 3 - проводить только документы оказания услуг в минус</comment>
    <type>
      <types>Boolean</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВключатьНормативныеМатериалыВСтоимостьУслуг</name>
    <comment>Значение для подстановки в записи регистра &quot;Нормы расхода материалов&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвтоматическиЗаполнятьНормыРасходаМатериаловОУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвтоматическиЗаполнятьНормыРасходаМатериаловПриема</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РедактироватьДатуНачалаДействияСертификатаПриПродаже</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтноситьСписаниеНаЗатратыПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнаяСтатьяЗатратСписанияТоваров</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </resources>
  <resources>
    <name>ВалютаУчета</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ЗапрашиватьПричинуЗакрытияЗаявок</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретНезаполненияХарактеристик</name>
    <comment>Запретить не указывать в документах характеристику для номенклатуры, по которой ведется учет по характеристикам</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокОкругленияПослеСкидки</name>
    <type>
      <types>EnumRef.ПорядкиОкругления</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьСекцииККМ</name>
    <comment>Относить сумму чека ККМ на различные секции ККМ</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ХранитьФотоКлиентовКакФайлы</name>
    <comment>Использовать файловый вариант хранения фото</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МаксимальныйРазмерФайлаФото</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказыватьЗакладкуSMSСообщенийВКалендареПланирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПоказыватьАртикул</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НастройкаСводногоОтчетаЗаСутки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойЦветНерабочегоВремени</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ОтдельнаяКолонкаРабочегоВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидПредставленияФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоУмолчаниюРучноеРедактированиеСкидок</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РежимЗаписиНаПрием</name>
    <type>
      <types>EnumRef.РежимыЗаписиНаПрием</types>
    </type>
  </resources>
  <resources>
    <name>ШаблонАнамнезаЖизни</name>
    <type>
      <types>CatalogRef.ШаблоныHTML</types>
    </type>
  </resources>
  <resources>
    <name>АвтоматическиШтрихкодироватьМедицинскиеКарты</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиУчетМестонахожденияМедкарт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УменьшатьВыработкуПриВозврате</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвтоСозданиеМедкарт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойВидМедКарт</name>
    <type>
      <types>CatalogRef.ВидыМедицинскихКарт</types>
    </type>
  </resources>
  <resources>
    <name>РаботаСЗубнымиКартами</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтображатьКолонкуЖЗДлительностиИнтервала</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РежимПроверкиДублейКлиентов</name>
    <type>
      <types>EnumRef.РежимыПроверкиДублейКлиентов</types>
    </type>
  </resources>
  <resources>
    <name>РежимПечатиПоШаблонуWORD</name>
    <type>
      <types>EnumRef.РежимыПечатиПоШаблонуWORD</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьЛистыОжиданияЗаписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПериодАвтообновленияЖурналаЗаписи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодичностьПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьСкидки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвтоматическоеСканированиеФайлов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РежимОтбораЖурналаЗаписиПоМоделямРасписания</name>
    <comment>Ложь - по подразделениям, Истина - по моделям расписания</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПоУмолчаниюПодборСубъектовВЖурналЗаписиПоСтруктуреОрганизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РазворачиватьДеревоСубъектовРасписанияПриПодбореВЖурналЗаписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазворачиватьДеревоМоделейРасписанияПриПодбореВЖурналЗаписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ФормироватьЖурналЗаписиБезОтбора</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВключатьВЖурналЗаписиУчастниковБезМоделейРасписания</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьCallЦентр</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользуетсяРежимВводаПриемаПоОдномуШаблону</name>
    <comment>Истина - для всех пользователей, Ложь - согласно настройке пользователя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьПрофосмотры</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьМедосмотрыСправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьЭЦП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьВерсионированиеШО</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НастройкаПолейСубъектаЭЦП</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>МинДлинаСтрокиПоискаКлиента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РежимЗаполненияДиагнозовПоПервичномуПриему</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаполнятьОказаниеУслугСПриоритетомИсходныхДанныхЗаявки</name>
    <comment>Истина - Данными заявки; Ложь - Данными приемов по этой заявке, если в них есть данные о выполненных услугах</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвтоматическиШтрихкодироватьПрМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиУчетПоХарактеристикам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПредставлениеВЧекеККМОперацииПополненияБаланса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЧекККМПродажаПечататьУслугиОднойСтрокой</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЧекККМПродажаОбщееНаименованиеУслуг</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЧекККМПродажаПечататьФИОКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьХозяйственныйБлок</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьАнкетирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МаксимальнаяСуммаДолгаКлиента</name>
    <type>
      <types>Boolean</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Catalogs/Валюты/Валюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Валюты</name>
  <predefined>
    <items>
      <name>Рубль</name>
      <description>руб.</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыПрописиНаРусском</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Catalogs/СтраныМира/СтраныМира.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтраныМира</name>
  <predefined>
    <items>
      <name>Россия</name>
      <description>РОССИЯ</description>
    </items>
  </predefined>
  <attributes>
    <name>КодАльфа2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодАльфа3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеждународноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчастникЕАЭС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/УчетнаяПолитика/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Данные локализации, автоматически определяемые по стране для заполнения по умочланию настроек учета.
//
// Параметры:
//  ОсновнаяСтрана - СправочникСсылка.СтраныМира - страна базы.
//
// Возвращаемое значение:
//  Структура.
//
Функция ПолучитьДанныеЛокализации(ОсновнаяСтрана) Экспорт
	
	Пресеты = ЗаполнитьПресеты();
	
	ДанныеЛокализации = Новый Структура;
	ДанныеЛокализации.Вставить("ОсновнаяВалюта",Справочники.Валюты.ПустаяСсылка());
	ДанныеЛокализации.Вставить("ОсновнойДУЛ",Справочники.ДокументыУдостоверяющиеЛичность.ПустаяСсылка());
	
	ДанныеПоСтране = Пресеты.Найти(ОсновнаяСтрана.Наименование, "НаименованиеСтраны");	
	
	// Валюта
	Если Не Справочники.Валюты.НайтиПоКоду(ОсновнаяСтрана.Код).Пустая() Тогда
		
		ДанныеЛокализации.Вставить("ОсновнаяВалюта",Справочники.Валюты.НайтиПоКоду(ОсновнаяСтрана.Код));
		
	ИначеЕсли Не ДанныеПоСтране = Неопределено Тогда
		
		Если Не Справочники.Валюты.НайтиПоКоду(ДанныеПоСтране.КодВалюты).Пустая() Тогда
			ДанныеЛокализации.Вставить("ОсновнаяВалюта", Справочники.Валюты.НайтиПоКоду(ДанныеПоСтране.КодВалюты));
		Иначе
			НоваяВалюта = Справочники.Валюты.СоздатьЭлемент();
			НоваяВалюта.Код = ДанныеПоСтране.КодВалюты;
			НоваяВалюта.Наименование = ДанныеПоСтране.НаименованиеВалюты;
			НоваяВалюта.НаименованиеПолное = ДанныеПоСтране.НаименованиеВалютыПолное;
			НоваяВалюта.Записать();
			
			ДанныеЛокализации.Вставить("ОсновнаяВалюта", Справочники.Валюты.НайтиПоКоду(ДанныеПоСтране.КодВалюты));
		КонецЕсли;
		
	КонецЕсли;
	
	// Вид ДУЛ
	Если ОсновнаяСтрана = Справочники.СтраныМира.Россия Тогда
		
		ДанныеЛокализации.Вставить("ОсновнойДУЛ",Справочники.ДокументыУдостоверяющиеЛичность.ИМНС21);
		
	ИначеЕсли Не ДанныеПоСтране = Неопределено Тогда
		
		СуществующийВидДУЛ = ОсновнойДУЛПоСтране(ДанныеПоСтране.СокращенноеНаименованиеСтраны);
		
		Если СуществующийВидДУЛ = Справочники.ДокументыУдостоверяющиеЛичность.ПустаяСсылка() Тогда
			
			НовыйВидДУЛ = Справочники.ДокументыУдостоверяющиеЛичность.СоздатьЭлемент();
			НовыйВидДУЛ.Наименование = ДанныеПоСтране.ОсновнойДУЛ;
			НовыйВидДУЛ.НеИмеетСерию = ДанныеПоСтране.НеИмеетСерию;
			НовыйВидДУЛ.МаскаСерииДокумента = ДанныеПоСтране.МаскаСерииДокумента;
			НовыйВидДУЛ.МаскаНомераДокумента = ДанныеПоСтране.МаскаНомераДокумента;
			НовыйВидДУЛ.Записать();
			
			ДанныеЛокализации.Вставить("ОсновнойДУЛ", НовыйВидДУЛ.Ссылка);
			
		Иначе
			ДанныеЛокализации.Вставить("ОсновнойДУЛ", СуществующийВидДУЛ);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДанныеЛокализации;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗаполнитьПресеты()
	
	Пресеты = Новый ТаблицаЗначений;
	Пресеты.Колонки.Добавить("НаименованиеСтраны");
	Пресеты.Колонки.Добавить("СокращенноеНаименованиеСтраны");
	Пресеты.Колонки.Добавить("КодВалюты");
	Пресеты.Колонки.Добавить("НаименованиеВалюты");
	Пресеты.Колонки.Добавить("НаименованиеВалютыПолное");
	Пресеты.Колонки.Добавить("ОсновнойДУЛ");
	Пресеты.Колонки.Добавить("НеИмеетСерию");
	Пресеты.Колонки.Добавить("МаскаСерииДокумента");
	Пресеты.Колонки.Добавить("МаскаНомераДокумента");
	Пресеты.Колонки.Добавить("СсылкаОсновнойДУЛ");
	
	НоваяСтрока = Пресеты.Добавить();
	НоваяСтрока.НаименованиеСтраны = НСтр("ru='КАЗАХСТАН'");
	НоваяСтрока.СокращенноеНаименованиеСтраны = НСтр("ru='КАЗАХ'");
	НоваяСтрока.КодВалюты = "398";
	НоваяСтрока.НаименованиеВалюты = НСтр("ru='тенге'");
	НоваяСтрока.НаименованиеВалютыПолное = НСтр("ru='Тенге'");
	НоваяСтрока.ОсновнойДУЛ = НСтр("ru='Паспорт гражданина Республики Казахстан'");
	НоваяСтрока.НеИмеетСерию = Истина;
	НоваяСтрока.МаскаСерииДокумента = "";
	НоваяСтрока.МаскаНомераДокумента = "X99999999";
	
	НоваяСтрока = Пресеты.Добавить();
	НоваяСтрока.СокращенноеНаименованиеСтраны = НСтр("ru='УКРА'");
	НоваяСтрока.НаименованиеСтраны = НСтр("ru='УКРАИНА'");
	НоваяСтрока.КодВалюты = "980";
	НоваяСтрока.НаименованиеВалюты = НСтр("ru='грн'");
	НоваяСтрока.НаименованиеВалютыПолное = НСтр("ru='Гривна'");
	НоваяСтрока.ОсновнойДУЛ = НСтр("ru='Паспорт гражданина Украины'");
	НоваяСтрока.НеИмеетСерию = Ложь;
	НоваяСтрока.МаскаСерииДокумента = "XX";
	НоваяСтрока.МаскаНомераДокумента = "999999";
	
	НоваяСтрока = Пресеты.Добавить();
	НоваяСтрока.НаименованиеСтраны = НСтр("ru='БЕЛАРУСЬ'");
	НоваяСтрока.СокращенноеНаименованиеСтраны = НСтр("ru='БЕЛАР'");
	НоваяСтрока.КодВалюты = "933";
	НоваяСтрока.НаименованиеВалюты = НСтр("ru='руб.'");
	НоваяСтрока.НаименованиеВалютыПолное = НСтр("ru='Белорусский рубль'");
	НоваяСтрока.ОсновнойДУЛ = НСтр("ru='Паспорт гражданина Республики Беларусь'");
	НоваяСтрока.НеИмеетСерию = Ложь;
	НоваяСтрока.МаскаСерииДокумента = "XX";
	НоваяСтрока.МаскаНомераДокумента = "9999999";
	
	НоваяСтрока = Пресеты.Добавить();
	НоваяСтрока.НаименованиеСтраны = НСтр("ru='АРМЕНИЯ'");
	НоваяСтрока.СокращенноеНаименованиеСтраны = НСтр("ru='АРМЕН'");
	НоваяСтрока.КодВалюты = "051";
	НоваяСтрока.НаименованиеВалюты = НСтр("ru='драм'");
	НоваяСтрока.НаименованиеВалютыПолное = НСтр("ru='Армянский драм'");
	НоваяСтрока.ОсновнойДУЛ = НСтр("ru='Паспорт гражданина Армении'");
	НоваяСтрока.НеИмеетСерию = Ложь;
	НоваяСтрока.МаскаСерииДокумента = "AX";
	НоваяСтрока.МаскаНомераДокумента = "9999999";
	
	НоваяСтрока = Пресеты.Добавить();
	НоваяСтрока.НаименованиеСтраны = НСтр("ru='ГРУЗИЯ'");
	НоваяСтрока.СокращенноеНаименованиеСтраны = НСтр("ru='ГРУЗ'");
	НоваяСтрока.КодВалюты = "981";
	НоваяСтрока.НаименованиеВалюты = НСтр("ru='лари'");
	НоваяСтрока.НаименованиеВалютыПолное = НСтр("ru='Грузинский лари'");
	НоваяСтрока.ОсновнойДУЛ = НСтр("ru='Паспорт гражданина Грузии'");
	НоваяСтрока.НеИмеетСерию = Ложь;
	НоваяСтрока.МаскаСерииДокумента = "99XX";
	НоваяСтрока.МаскаНомераДокумента = "999999";
	
	НоваяСтрока = Пресеты.Добавить();
	НоваяСтрока.НаименованиеСтраны = НСтр("ru='ОБЪЕДИНЕННЫЕ АРАБСКИЕ ЭМИРАТЫ'");
	НоваяСтрока.СокращенноеНаименованиеСтраны = НСтр("ru='АРАБ'");
	НоваяСтрока.КодВалюты = "840";
	НоваяСтрока.НаименованиеВалюты = НСтр("ru='дол.'");
	НоваяСтрока.НаименованиеВалютыПолное = НСтр("ru='Доллар США'");
	НоваяСтрока.ОсновнойДУЛ = НСтр("ru='Паспорт гражданина Объединенных Арабских Эмиратов'");
	НоваяСтрока.НеИмеетСерию = Истина;
	НоваяСтрока.МаскаСерииДокумента = "";
	НоваяСтрока.МаскаНомераДокумента = "999999";
	
	Возврат Пресеты;
	
КонецФункции

Функция ОсновнойДУЛПоСтране(СокращенноеНаименованиеСтраны)
	
	ДУЛ = Справочники.ДокументыУдостоверяющиеЛичность.Выбрать();
	
	Пока ДУЛ.Следующий() Цикл
		Если СтрНайти(ВРег(ДУЛ.Наименование), СокращенноеНаименованиеСтраны) > 0 Тогда
			Возврат ДУЛ.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Справочники.ДокументыУдостоверяющиеЛичность.ПустаяСсылка();
	
КонецФункции

#КонецОбласти
